/** Основные цвета проекта */
export const colors = {
    brandRed: {
      darkestRed: '#81002A',
      darkRed: '#990032',
      red: '#B70037',
  
      200: '#28292B', // black
      120: '#505254',
      100: '#66686B',
      80: '#A8A9AA',
      60: '#CBCFD6',
      40: '#F2F2F5',
      20: '#F9F9FA',
      0: '#FFFFFF', // white
    },
    gray: {
      220: '#000000',
      200: '#28292B', // black
      180: '#868787',
      120: '#505254',
      100: '#66686B',
      90: '#6A6B6D',
      80: '#A9ADB2',
      61: '#20201f',
      60: '#CBCFD6',
      40: '#F2F2F5',
      39: '#c2c2c2',
      35: '#D9D9D9',
      30: '#E5E7EB',
      20: '#F9F9FA',
      0: '#FFFFFF', // white
    },
    additionalRed: {
      200: '#81002A', // darkestRed
      120: '#FF5652',
      100: '#DD0042',
      80: '#C5335F',
      70: null,
      60: '#D46687',
      40: '#E299AF',
      20: '#F8E6E9',
    },
    purple: {
      200: '#944CA6', //
      150: '#F6D4DA',
      120: null,
      100: '#944CA6',
      80: '#A970B8',
      70: '#9518C0',
      60: '#BF94CA',
      40: '#D4B7DB',
      20: '#EADBED',
    },
    blue: {
      200: '#405EAC', //
      120: null,
      100: '#405EAC',
      80: '#5E7ED1',
      60: '#BACDFE',
      40: '#DEE7FF',
      20: '#EBF0FF',
    },
    brown: {
      200: '#4C2B3B', //
      120: null,
      100: '#4C2B3B',
      80: '#705562',
      60: '#948089',
      40: '#B7AAB1',
      20: '#DBD5D8',
    },
    golden: {
      200: '#4C3000',
      120: null,
      110: '#F08523',
      100: '#C88C46',
      80: '#D3A36B',
      60: '#E4B884',
      40: '#FBEABC',
      20: '#FFF6DD',
    },
    violet: {
      200: '#2F2233',
      120: null,
      100: '#794EAE',
      80: '#9372BE',
      60: '#AE95CF',
      40: '#C9B8DF',
      20: '#E4DCEF',
    },
    green: {
      200: '#003E20',
      120: null,
      100: '#02AB6E',
      80: '#3CBC7F',
      60: '#67CD9C',
      40: '#9ADEBD',
      20: '#CCEEDE',
    },
  } as const;
  